      ******************************************************************
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. mainprog.
       AUTHOR.     Rémi.

      ******************************************************************

       PROCEDURE DIVISION.
       0000-START-MAIN.
           CALL 'menulook'.
       END-0000-MAIN.
           STOP RUN.
