       IDENTIFICATION DIVISION.
       PROGRAM-ID. ctmenu.
       AUTHOR. Alexandre.

      ******************************************************************       
       
       ENVIRONMENT DIVISION.

      ******************************************************************

       DATA DIVISION.

       WORKING-STORAGE SECTION.
 
      ******************************************************************

       PROCEDURE DIVISION.
       
       0000-START-MAIN.

           ACCEPT SCREEN-CONTRAT-SPECIFIQUE.

       END-0000-MAIN.
           GOBACK.
      ******************************************************************       
       